Tekla.Structures.Model.Offset
The Offset class defines the offset value of start points and end points. The offset is the
distance from the current work plane in the three global directions.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
Point point = new Point(0, 0, 0);
Point point2 = new Point(1000, 0, 0);
Beam beam = new Beam(point, point2);
beam.StartPointOffset.Dx = 105.0;
beam.StartPointOffset.Dy = 205.0;
beam.StartPointOffset.Dz = 305.0;
beam.EndPointOffset.Dx = 405.0;
beam.EndPointOffset.Dy = 505.0;
beam.EndPointOffset.Dz = 605.0;
beam.Profile.ProfileString = "HEA400";
beam.Finish = "PAINT";
bool result = false;
result = beam.Insert();
}
}

Tekla.Structures.Model.Offset.Dx
The current object's Dx offset. This value is defined using the object's coordinate system.

Tekla.Structures.Model.Offset.Dy
The current object's Dy offset. This value is defined using the current work plane.

Tekla.Structures.Model.Offset.Dz
The current object's Dz offset. This value is defined using the current work plane.

Tekla.Structures.Model.Offset.#ctor
Instantiates an offset with zero distance.